[command]/home/runner/work/_temp/c4104684-f7b5-4f57-a2e4-54e05999e3fb/terraform-bin show -no-color tfplan.txt

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.demo_bucket will be created
  + resource "aws_s3_bucket" "demo_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "us-east-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Demo"
          + "Owner"       = "Copilot"
        }
      + tags_all                    = {
          + "Environment" = "Demo"
          + "Owner"       = "Copilot"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.demo_bucket_acl will be created
  + resource "aws_s3_bucket_acl" "demo_bucket_acl" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "us-east-1"

      + access_control_policy (known after apply)
    }

  # random_pet.name will be created
  + resource "random_pet" "name" {
      + id        = (known after apply)
      + length    = 2
      + separator = "-"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket = {
      + acceleration_status                  = (known after apply)
      + acl                                  = (known after apply)
      + arn                                  = (known after apply)
      + bucket                               = (known after apply)
      + bucket_domain_name                   = (known after apply)
      + bucket_prefix                        = (known after apply)
      + bucket_region                        = (known after apply)
      + bucket_regional_domain_name          = (known after apply)
      + cors_rule                            = (known after apply)
      + force_destroy                        = false
      + grant                                = (known after apply)
      + hosted_zone_id                       = (known after apply)
      + id                                   = (known after apply)
      + lifecycle_rule                       = (known after apply)
      + logging                              = (known after apply)
      + object_lock_configuration            = (known after apply)
      + object_lock_enabled                  = (known after apply)
      + policy                               = (known after apply)
      + region                               = "us-east-1"
      + replication_configuration            = (known after apply)
      + request_payer                        = (known after apply)
      + server_side_encryption_configuration = (known after apply)
      + tags                                 = {
          + Environment = "Demo"
          + Owner       = "Copilot"
        }
      + tags_all                             = {
          + Environment = "Demo"
          + Owner       = "Copilot"
        }
      + timeouts                             = null
      + versioning                           = (known after apply)
      + website                              = (known after apply)
      + website_domain                       = (known after apply)
      + website_endpoint                     = (known after apply)
    }
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_s3_bucket.demo_bucket will be created%0A  + resource "aws_s3_bucket" "demo_bucket" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = (known after apply)%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_region               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = "us-east-1"%0A      + request_payer               = (known after apply)%0A      + tags                        = {%0A          + "Environment" = "Demo"%0A          + "Owner"       = "Copilot"%0A        }%0A      + tags_all                    = {%0A          + "Environment" = "Demo"%0A          + "Owner"       = "Copilot"%0A        }%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A%0A      + cors_rule (known after apply)%0A%0A      + grant (known after apply)%0A%0A      + lifecycle_rule (known after apply)%0A%0A      + logging (known after apply)%0A%0A      + object_lock_configuration (known after apply)%0A%0A      + replication_configuration (known after apply)%0A%0A      + server_side_encryption_configuration (known after apply)%0A%0A      + versioning (known after apply)%0A%0A      + website (known after apply)%0A    }%0A%0A  # aws_s3_bucket_acl.demo_bucket_acl will be created%0A  + resource "aws_s3_bucket_acl" "demo_bucket_acl" {%0A      + acl    = "private"%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + region = "us-east-1"%0A%0A      + access_control_policy (known after apply)%0A    }%0A%0A  # random_pet.name will be created%0A  + resource "random_pet" "name" {%0A      + id        = (known after apply)%0A      + length    = 2%0A      + separator = "-"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + s3_bucket = {%0A      + acceleration_status                  = (known after apply)%0A      + acl                                  = (known after apply)%0A      + arn                                  = (known after apply)%0A      + bucket                               = (known after apply)%0A      + bucket_domain_name                   = (known after apply)%0A      + bucket_prefix                        = (known after apply)%0A      + bucket_region                        = (known after apply)%0A      + bucket_regional_domain_name          = (known after apply)%0A      + cors_rule                            = (known after apply)%0A      + force_destroy                        = false%0A      + grant                                = (known after apply)%0A      + hosted_zone_id                       = (known after apply)%0A      + id                                   = (known after apply)%0A      + lifecycle_rule                       = (known after apply)%0A      + logging                              = (known after apply)%0A      + object_lock_configuration            = (known after apply)%0A      + object_lock_enabled                  = (known after apply)%0A      + policy                               = (known after apply)%0A      + region                               = "us-east-1"%0A      + replication_configuration            = (known after apply)%0A      + request_payer                        = (known after apply)%0A      + server_side_encryption_configuration = (known after apply)%0A      + tags                                 = {%0A          + Environment = "Demo"%0A          + Owner       = "Copilot"%0A        }%0A      + tags_all                             = {%0A          + Environment = "Demo"%0A          + Owner       = "Copilot"%0A        }%0A      + timeouts                             = null%0A      + versioning                           = (known after apply)%0A      + website                              = (known after apply)%0A      + website_domain                       = (known after apply)%0A      + website_endpoint                     = (known after apply)%0A    }%0A
::debug::stderr: 
::debug::exitcode: 0
